In [1]:
import pandas as pd

__Series__

In [3]:
obj = pd.Series([5,1,2,3])
print(obj.values)
print(obj.index)

[5 1 2 3]
RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2=pd.Series([4,3,1,2],index=['d','c','a','b'])
obj2

d    4
c    3
a    1
b    2
dtype: int64

In [6]:
obj2[['b','c','d']]

b    2
c    3
d    4
dtype: int64

In [8]:
obj2*2

d    8
c    6
a    2
b    4
dtype: int64

In [11]:
#딕셔너리 -> 시리즈

dct={'a':10,'c':20,'b':30,'e':40}
ser=pd.Series(dct)
print(ser)
keys=['aa','c','b','e']
ser2=pd.Series(dct,keys)
print(ser2)

a    10
c    20
b    30
e    40
dtype: int64
aa     NaN
c     20.0
b     30.0
e     40.0
dtype: float64

In [13]:
ser+ser2  # 둘 중 하나에라도 없으면 연산 진행 X , NaN 출력

a      NaN
aa     NaN
b     60.0
c     40.0
e     80.0
dtype: float64

__name 속성__

In [17]:
ser2.name='population'
ser2.index.name='city'
ser2

city
aa     NaN
c     20.0
b     30.0
e     40.0
Name: population, dtype: float64

__dataframe__

In [18]:
import numpy as np
a=[1,2,3.14,'a']
arr=np.array(a)
print(a)
print(arr)

[1, 2, 3.14, 'a']
['1' '2' '3.14' 'a']

In [20]:
data={'city':['Seoul','Daegu','Busan','Gwangju'],
     'year':[2000,2001,2002,2003]}
df=pd.DataFrame(data)
df

      city  year
0    Seoul  2000
1    Daegu  2001
2    Busan  2002
3  Gwangju  2003

## __오후__

In [23]:
obj=pd.Series(range(11,14),index=['a','b','c'])

In [24]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [32]:
# 행,열 삭제

obj = pd.Series(np.arange(11,16),index=['a','b','c','d','e'])
# del obj['c']
# obj
# new_obj=obj.drop(['c','d'])
# new_obj
obj.loc['c']

13

In [34]:
data=pd.DataFrame(np.arange(16).reshape(4,4),
                 index=['Gwangju','Seoul','Jeju','Busan'],
                 columns=['one','two','three','four'])
data

         one  two  three  four
Gwangju    0    1      2     3
Seoul      4    5      6     7
Jeju       8    9     10    11
Busan     12   13     14    15

In [48]:
file_name='test_csv_file.csv'
file_path='./파일연습/'
df = pd.read_csv(file_path+file_name,index_col='ID')
df

   LAST_NAME  AGE
ID
1        KIM   30
2       CHOI   25
3        LEE   41
4       PARK   19
5        LIM   36

In [40]:
file_name='test_text_file.txt'
file_path='./파일연습/'
df2 = pd.read_csv(file_path+file_name,sep='|')
df2

   ID  A  B  C  D
0  C1  1  2  3  4
1  C2  5  6  7  8
2  C3  1  3  5  7

In [47]:
file_name='gapminder.tsv'
file_path='./파일연습/'
df3 = pd.read_csv(file_path+file_name,sep='\t')
df3

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [53]:
file_name='text_without_column_name.txt'
file_path='./파일연습/'
df4 = pd.read_csv(file_path+file_name,sep='|',header=None,names=['ID','a','b','c','d'],index_col='ID')
df4

    a  b  c  d
ID
C1  1  2  3  4
C2  5  6  7  8
C3  1  3  5  7

__pandas.pydata.org__

In [58]:
file_name='test_csv_file.csv'
file_path='./파일연습/'
df5 = pd.read_csv(file_path+file_name,skiprows=[1,4],header=None)
# or nrows=k : k개 줄만 읽어옴
df5

    0          1    2
0  ID  LAST_NAME  AGE
1   2       CHOI   25
2   3        LEE   41
3   5        LIM   36